Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes Class
 A collection of ids of the ExternalResourceTypes provided by Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class BuiltInExternalResourceTypes
Visual Basic
Public NotInheritable Class BuiltInExternalResourceTypes
Visual C++
public ref class BuiltInExternalResourceTypes abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Members
Autodesk.Revit.DB Namespace